scripts/mutations/M1_random_keeps_fixed_and_maxdelay.patch
--- a/retrypolicy/retry.go
+++ b/retrypolicy/retry.go
@@ -319,9 +319,7 @@
 	c.delayMax = delayMax
 
 	// Clear fixed, backoff, and computed delays since delay modes are mutually exclusive
-	c.Delay = 0
 	c.DelayFunc = nil
-	c.maxDelay = 0
 	c.delayFactor = 0
 	return c
 }
